In [23]:
import pandas as pd
import numpy as np
# Load data
df = pd.read_csv('Data/1-collected data.csv')
df.head()

,job_title,location,career_level,experience,job_type,job_description
0,Data Analyst,Johor Bahru,Non-Executive,Full-Time,"Computer/Information Technology, IT-Software",ZEMPOT MALAYSIA SDN BHD is a newly branched co...
1,Director- Data Analytics,Petaling Jaya,Senior Manager,12 years,Full-Time,Job overviewWe are looking for a highly motiva...
2,Solutions Architect - Data Lake Specialist (Ba...,Kuala Lumpur,Senior Executive,8 years,Full-Time,We are looking for a Solutions Architect who s...
3,Automotive Analyst – Vehicle Valuation,Kuala Lumpur,Senior Executive,3 years,Full-Time,DescriptionThe Automotive Analyst will be acco...
4,IT Business Analyst,Kuala Lumpur,Senior Executive,4 years,Full-Time,Position Objective:-Responsible to be the IT B...

In [24]:
# Number of rows and columns
print("The number of rows: {0} ".format(df.shape[0]), '\n')
print("The number of columns: {0} ".format(df.shape[1]), '\n')

# Missing value
print("Missing value: ", '\n',df.isna().sum(), '\n')

# Duplicated value
print("Duplicated value: ",df.duplicated().sum(), '\n')

The number of rows: 15504

The number of columns: 6

Missing value:
 job_title          1941
location              0
career_level          0
experience            0
job_type           1231
job_description       0
dtype: int64

Duplicated value:  2431

## Data Cleaning

### 1. regularize data format
convert to lower case

In [25]:
#to lowercase
df['job_title'] = df['job_title'].str.lower()
df['location'] = df['location'].str.lower()
#df['job_description'] = df['job_description'].str.lower()
df['career_level'] = df['career_level'].str.lower()
df['experience'] = df['experience'].str.lower()
df['job_type'] = df['job_type'].str.lower()
df.head()

,job_title,location,career_level,experience,job_type,job_description
0,data analyst,johor bahru,non-executive,full-time,"computer/information technology, it-software",ZEMPOT MALAYSIA SDN BHD is a newly branched co...
1,director- data analytics,petaling jaya,senior manager,12 years,full-time,Job overviewWe are looking for a highly motiva...
2,solutions architect - data lake specialist (ba...,kuala lumpur,senior executive,8 years,full-time,We are looking for a Solutions Architect who s...
3,automotive analyst – vehicle valuation,kuala lumpur,senior executive,3 years,full-time,DescriptionThe Automotive Analyst will be acco...
4,it business analyst,kuala lumpur,senior executive,4 years,full-time,Position Objective:-Responsible to be the IT B...

### 2. drop missing values where job title is empty

In [26]:
#Drop missing value in job title  
df = df[df['job_title'].notna()]
df.shape

(13563, 6)

### 3. fill missing values by 'not specified'

In [27]:
type_list = ['full-time', 'internship', 'contract','part-time', 'temporary']                                                 
for t in type_list:
    ie =  df[df['experience'] == t].index
    for i in list(ie):
        df['job_type'][i] = t
df['job_type'] = df['job_type'].fillna('not specified')
df.job_type.value_counts()

job_type
full-time        10650
not specified     1230
contract          1011
internship         503
temporary          135
part-time           34
Name: count, dtype: int64

'experience' only contain 'year' information:

In [28]:
dump_list = list(df[~df['experience'].str.contains('year')].index)
for i in dump_list:
    df['experience'][i]  = 'not specified'
for i in df.index:
    x = df['experience'][i]
    if 'year' in x:
        df.loc[i,'experience'] = x.split(' ')[0]
df.experience.value_counts()

experience
not specified    7120
2                1431
3                1425
1                1425
5                1123
4                 370
8                 188
10                167
6                 154
7                 127
15                 13
12                 11
9                   5
13                  2
14                  1
20                  1
Name: count, dtype: int64

### 4. standardize location: keep only one job location

In [29]:
df['location'] = df['location'].str.split('/').str[0]
df['location'] = df['location'].str.split('-').str[0]

In [30]:
for i in df.index:
    location = df['location'][i]
    if 'multiple work locations' in location:
        df.loc[i,'location'] = "multiple work locations"

### 5. Drop duplicated value

In [31]:
print("Duplicated value: ",df.duplicated().sum(), '\n')
df.drop_duplicates(inplace=True)

Duplicated value:  2379

## After data cleaning

In [32]:
print('shape: ', df.shape, '\n')
print("Duplicated value: ", df.duplicated().sum() , '\n')
print("Missing value: ", '\n', df.isna().sum())

shape:  (11184, 6)

Duplicated value:  0

Missing value:
 job_title          0
location           0
career_level       0
experience         0
job_type           0
job_description    0
dtype: int64

In [44]:
#df.to_csv('Data/2-preprocessed data.csv', index=False)